#+STARTUP: content

* wpa

** setup script

   #+BEGIN_SRC fundamental :noweb-ref ssid
     example-ssid
   #+END_SRC

   #+BEGIN_SRC fundamental :noweb-ref password
     example-password
   #+END_SRC

   #+BEGIN_SRC fundamental :noweb-ref interface
     example-interface
   #+END_SRC

   #+BEGIN_SRC sh :tangle ~/setupwpasupplicant.sh :noweb yes :shebang #!/bin/bash
     INTERFACE=<<interface>>
     cat <<EOF > /etc/wpa_supplicant/wpa_supplicant.conf
     ctrl_interface=/run/wpa_supplicant
     update_config=1
     EOF

     ip link set $INTERFACE up
     wpa_supplicant -B -i $INTERFACE -c /etc/wpa_supplicant/wpa_supplicant.conf

     # if there is no network 0, add it
     ! wpa_cli list_networks | grep -E "^0\s+" && wpa_cli add_network

     wpa_cli <<EOF
     scan
     set_network 0 ssid "<<ssid>>"
     set_network 0 psk "<<password>>"
     enable_network 0
     save_config
     EOF

     systemctl start  wpa_supplicant@$INTERFACE
     systemctl status wpa_supplicant@$INTERFACE
     systemctl enable wpa_supplicant@$INTERFACE

     systemctl start  dhcpcd@$INTERFACE
     systemctl status dhcpcd@$INTERFACE
     systemctl enable dhcpcd@$INTERFACE
   #+END_SRC

* packages

  Current explicitly installed packages

  #+begin_src sh
    pacman -Qe
  #+end_src

  #+RESULTS:
  | acpi_call                   |             1.1.0-313 |
  | alacritty                   |               0.4.2-2 |
  | alsa-tools                  |               1.2.2-1 |
  | alsa-utils                  |               1.2.2-1 |
  | android-tools               |              29.0.6-1 |
  | arm-none-eabi-gcc           |               9.3.0-1 |
  | arm-none-eabi-gdb           |                 9.1-1 |
  | arm-none-eabi-newlib        |               3.3.0-1 |
  | autoconf                    |                2.69-7 |
  | automake                    |              1.16.2-1 |
  | avrdude                     |               1:6.3-6 |
  | baobab                      |              3.34.0-1 |
  | base                        |                   2-2 |
  | binutils                    |                2.34-2 |
  | bison                       |               3.5.4-1 |
  | boost                       |              1.72.0-2 |
  | bridge-utils                |                 1.6-4 |
  | ccache                      |               3.7.9-1 |
  | cheese                      | 3.34.0+23+gcac6d3a1-1 |
  | cmake                       |              3.17.2-1 |
  | dfu-util                    |                 0.9-2 |
  | dhcpcd                      |               9.0.2-1 |
  | dmidecode                   |                 3.2-1 |
  | dnsmasq                     |                2.81-3 |
  | dosbox                      |              0.74.3-1 |
  | ebtables                    |            2.0.10_4-7 |
  | efibootmgr                  |                  17-1 |
  | emacs                       |                26.3-1 |
  | evince                      |              3.36.0-1 |
  | exo                         |             0.12.11-1 |
  | f3                          |                 7.2-1 |
  | fakeroot                    |                1.24-2 |
  | feh                         |                 3.4-1 |
  | file-roller                 |              3.36.2-1 |
  | fish                        |               3.1.1-1 |
  | flameshot                   |               0.6.0-4 |
  | flex                        |               2.6.4-3 |
  | foliate                     |               2.1.1-1 |
  | fritzing                    |              0.9.4b-2 |
  | fwupd                       |               1.4.0-1 |
  | garcon                      |               0.6.4-1 |
  | gcc                         |               9.3.0-1 |
  | gdb                         |                 9.1-2 |
  | gifsicle                    |                1.92-1 |
  | gimp                        |             2.10.18-6 |
  | git                         |              2.26.2-1 |
  | gnome-disk-utility          |              3.36.1-2 |
  | google-chrome               |       81.0.4044.129-1 |
  | gparted                     |               1.1.0-1 |
  | gperf                       |                 3.1-2 |
  | grub                        |              2:2.04-5 |
  | gvfs                        |              1.44.1-1 |
  | gvim                        |            8.2.0510-2 |
  | help2man                    |             1.47.15-1 |
  | htop                        |               2.2.0-3 |
  | i3-gaps                     |              4.18.1-1 |
  | i3blocks                    |                 1.5-3 |
  | i3lock                      |                2.12-1 |
  | i3status                    |                2.13-2 |
  | inkscape                    |                 1.0-2 |
  | iw                          |                 5.4-1 |
  | iwd                         |                 1.7-1 |
  | keepassxc                   |               2.5.4-2 |
  | kicad                       |               5.1.5-2 |
  | konsole                     |             20.04.0-1 |
  | layan-gtk-theme-git         |       0.0.0.efe32ee-1 |
  | libgit2                     |             1:1.0.0-1 |
  | libvirt                     |              5.10.0-3 |
  | linux                       |         5.6.8.arch1-1 |
  | linux-firmware              |    20200421.78c0348-1 |
  | love                        |                11.3-1 |
  | lux                         |                 1.2-1 |
  | m4                          |              1.4.18-3 |
  | make                        |                 4.3-3 |
  | meson                       |              0.54.1-1 |
  | minicom                     |               2.7.1-3 |
  | mlocate                     |   0.26.git.20170220-3 |
  | mosh                        |              1.3.2-11 |
  | mousepad                    |               0.4.2-2 |
  | ncurses5-compat-libs        |                 6.1-1 |
  | nmap                        |                7.80-2 |
  | nss                         |              3.51.1-1 |
  | openbsd-netcat              |             1.206_1-1 |
  | openssh                     |               8.2p1-3 |
  | orage                       |              4.12.1-4 |
  | p7zip                       |               16.02-5 |
  | parole                      |               1.0.5-1 |
  | patch                       |               2.7.6-8 |
  | pavucontrol                 |               1:4.0-1 |
  | pcmanfm                     |               1.3.1-1 |
  | picom                       |                 7.5-3 |
  | pkgconf                     |               1.6.3-4 |
  | powertop                    |                2.11-1 |
  | progress                    |                0.14-1 |
  | pulseaudio-alsa             |                   2-5 |
  | pulseaudio-equalizer-ladspa |               3.0.2-3 |
  | pulseview                   |               0.4.2-1 |
  | python-pip                  |              20.0.2-1 |
  | python-pyserial             |                 3.4-4 |
  | python2-click               |               7.1.1-1 |
  | python2-cryptography        |               2.9.2-1 |
  | python2-future              |              0.18.2-2 |
  | python2-pip                 |              20.0.2-1 |
  | python2-pyparsing           |               2.4.7-1 |
  | python2-pyserial            |                 3.4-4 |
  | python2-virtualenv          |             20.0.18-1 |
  | qemu                        |               4.2.0-2 |
  | qemu-arch-extra             |               4.2.0-2 |
  | qemu-block-gluster          |               4.2.0-2 |
  | qt5-serialport              |              5.14.2-1 |
  | qutebrowser                 |              1.11.0-1 |
  | ranger                      |               1.9.3-1 |
  | redshift                    |                1.12-3 |
  | ripgrep                     |              12.0.1-1 |
  | ristretto                   |              0.10.0-2 |
  | rofi                        |               1.5.4-1 |
  | rsync                       |               3.1.3-3 |
  | ruby                        |               2.7.1-2 |
  | rxvt-unicode                |                9.22-9 |
  | sigrok-cli                  |               0.7.1-2 |
  | sof-firmware                |               1.4.2-1 |
  | st                          |              0.8.2-10 |
  | stlink                      |               1.6.0-1 |
  | sudo                        |           1.8.31.p1-1 |
  | terminus-font               |                4.48-1 |
  | terminus-font-otb           |                4.48-1 |
  | texinfo                     |                 6.7-3 |
  | the_silver_searcher         |               2.2.0-1 |
  | throttled                   |                 0.7-1 |
  | thunar                      |              1.8.14-1 |
  | thunar-archive-plugin       |               0.4.0-2 |
  | thunar-media-tags-plugin    |               0.3.0-1 |
  | thunar-volman               |               0.9.5-2 |
  | tlp                         |               1.3.1-2 |
  | tmux                        |               3.1_a-1 |
  | tree                        |               1.8.0-2 |
  | ttf-croscore                |            20190926-4 |
  | ttf-fira-code               |                 3.1-1 |
  | ttf-liberation              |               2.1.0-1 |
  | ttf-opensans                |               1.101-1 |
  | ttf-roboto                  |               2.138-1 |
  | ttf-ubuntu-font-family      |                0.83-5 |
  | tumbler                     |               0.2.8-1 |
  | udisks2                     |               2.8.4-2 |
  | usbutils                    |                 012-2 |
  | vifm                        |              0.10.1-1 |
  | virt-manager                |               2.2.1-2 |
  | vulkan-intel                |              20.0.6-2 |
  | wine                        |                 5.7-1 |
  | wireless_tools              |             30.pre9-3 |
  | wpa_supplicant              |               2:2.9-7 |
  | xcape                       |                 1.2-3 |
  | xclip                       |                0.13-2 |
  | xf86-video-vesa             |               2.4.0-2 |
  | xfburn                      |               0.6.2-1 |
  | xfce4-appfinder             |              4.14.0-1 |
  | xfce4-artwork               |  0.1.1a_git20110420-5 |
  | xfce4-battery-plugin        |               1.1.3-1 |
  | xfce4-clipman-plugin        |               1.6.1-1 |
  | xfce4-cpufreq-plugin        |               1.2.1-1 |
  | xfce4-cpugraph-plugin       |               1.1.0-1 |
  | xfce4-datetime-plugin       |               0.8.0-1 |
  | xfce4-dict                  |               0.8.3-1 |
  | xfce4-diskperf-plugin       |               2.6.2-1 |
  | xfce4-eyes-plugin           |               4.5.0-1 |
  | xfce4-fsguard-plugin        |               1.1.1-1 |
  | xfce4-genmon-plugin         |               4.0.2-1 |
  | xfce4-mailwatch-plugin      |               1.2.0-8 |
  | xfce4-mount-plugin          |               1.1.3-1 |
  | xfce4-mpc-plugin            |               0.5.2-1 |
  | xfce4-netload-plugin        |               1.3.2-1 |
  | xfce4-notes-plugin          |               1.8.1-4 |
  | xfce4-notifyd               |               0.6.0-1 |
  | xfce4-panel                 |              4.14.4-1 |
  | xfce4-power-manager         |               1.6.6-1 |
  | xfce4-pulseaudio-plugin     |               0.4.3-1 |
  | xfce4-screensaver           |              0.1.10-1 |
  | xfce4-screenshooter         |               1.9.7-1 |
  | xfce4-sensors-plugin        |              1.3.92-1 |
  | xfce4-session               |              4.14.2-2 |
  | xfce4-settings              |              4.14.3-1 |
  | xfce4-smartbookmark-plugin  |               0.5.1-1 |
  | xfce4-systemload-plugin     |               1.2.3-1 |
  | xfce4-taskmanager           |               1.2.3-1 |
  | xfce4-terminal              |             0.8.9.2-1 |
  | xfce4-time-out-plugin       |               1.1.0-1 |
  | xfce4-timer-plugin          |               1.7.0-1 |
  | xfce4-verve-plugin          |               2.0.0-1 |
  | xfce4-wavelan-plugin        |               0.6.1-1 |
  | xfce4-weather-plugin        |              0.10.1-1 |
  | xfce4-whiskermenu-plugin    |               2.4.4-1 |
  | xfce4-xkb-plugin            |               0.8.1-2 |
  | xfconf                      |              4.14.1-1 |
  | xfdesktop                   |              4.14.2-1 |
  | xfwm4                       |              4.14.2-1 |
  | xfwm4-themes                |              4.10.0-3 |
  | xorg-bdftopcf               |                 1.1-1 |
  | xorg-docs                   |               1.7.1-2 |
  | xorg-font-util              |               1.3.2-1 |
  | xorg-fonts-100dpi           |               1.0.3-4 |
  | xorg-fonts-75dpi            |               1.0.3-4 |
  | xorg-fonts-encodings        |               1.0.5-1 |
  | xorg-luit                   |               1.1.1-3 |
  | xorg-mkfontscale            |               1.2.1-2 |
  | xorg-server                 |              1.20.8-1 |
  | xorg-server-common          |              1.20.8-1 |
  | xorg-server-devel           |              1.20.8-1 |
  | xorg-server-xdmx            |              1.20.6-1 |
  | xorg-server-xephyr          |              1.20.8-1 |
  | xorg-server-xnest           |              1.20.8-1 |
  | xorg-server-xvfb            |              1.20.8-1 |
  | xorg-server-xwayland        |              1.20.8-1 |
  | xorg-sessreg                |               1.1.2-1 |
  | xorg-setxkbmap              |               1.3.2-1 |
  | xorg-smproxy                |               1.0.6-2 |
  | xorg-x11perf                |               1.6.1-1 |
  | xorg-xbacklight             |               1.2.3-1 |
  | xorg-xcmsdb                 |               1.0.5-2 |
  | xorg-xcursorgen             |               1.0.7-1 |
  | xorg-xdpyinfo               |               1.3.2-3 |
  | xorg-xdriinfo               |               1.0.6-1 |
  | xorg-xev                    |               1.2.3-1 |
  | xorg-xfontsel               |               1.0.6-1 |
  | xorg-xgamma                 |               1.0.6-2 |
  | xorg-xhost                  |               1.0.8-1 |
  | xorg-xinput                 |               1.6.3-1 |
  | xorg-xkbcomp                |               1.4.3-1 |
  | xorg-xkbevd                 |               1.1.4-2 |
  | xorg-xkbutils               |               1.0.4-3 |
  | xorg-xkill                  |               1.0.5-1 |
  | xorg-xlsatoms               |               1.1.3-1 |
  | xorg-xlsclients             |               1.1.4-1 |
  | xorg-xpr                    |               1.0.5-1 |
  | xorg-xprop                  |               1.2.4-1 |
  | xorg-xrandr                 |               1.5.1-1 |
  | xorg-xrefresh               |               1.0.6-1 |
  | xorg-xset                   |               1.2.4-1 |
  | xorg-xsetroot               |               1.1.2-1 |
  | xorg-xvinfo                 |               1.1.4-1 |
  | xorg-xwd                    |               1.0.7-1 |
  | xorg-xwininfo               |               1.1.5-1 |
  | xorg-xwud                   |               1.0.5-1 |
  | xscreensaver                |                5.44-1 |
  | xsel                        |      1.2.0.20190821-1 |
  | xterm                       |                 355-1 |
  | zsh                         |                 5.8-1 |

* aur packages

  Some AUR packages I use

  #+begin_src sh
    git clone https://aur.archlinux.org/lux.git
    git clone https://aur.archlinux.org/google-chrome.git
    git clone https://aur.archlinux.org/chrome-remote-desktop.git
    # git clone https://aur.archlinux.org/fritzing.git
    # git clone https://aur.archlinux.org/layan-gtk-theme-git.git
    # git clone https://aur.archlinux.org/paper-icon-theme-git.git
    # git clone https://aur.archlinux.org/f3.git
    # git clone https://aur.archlinux.org/ncurses5-compat-libs.git
    # git clone https://aur.archlinux.org/aurman.git
  #+end_src

** google-chrome example

  #+BEGIN_SRC sh
    mkdir -p ~/aurpkgs
    cd ~/aurpkgs
    rm -rf google-chrome.git
    git clone https://aur.archlinux.org/google-chrome.git google-chrome.git
    cd google-chrome.git
    makepkg -i
  #+END_SRC

* lm_sensors

  #+BEGIN_SRC sh
    # install
    sudo pacman -S lm_sensors
    # display configured sensors
    sensors
  #+END_SRC
